---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalService.ServiceId
source: html/a5988799-0b50-7b30-797d-ed7ef569287c.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalService.ServiceId Property

The Id of the service

## Syntax (C#)
```csharp
public ExternalServiceId ServiceId { get; }
```